{"format": "layers-model", "generatedBy": "keras v2.4.0", "convertedBy": "TensorFlow.js Converter v2.4.0", "modelTopology": {"keras_version": "2.4.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 256, 256, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "conv2d_3_input"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_3", "trainable": true, "batch_input_shape": [null, 256, 256, 3], "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_4", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_5", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_5", "trainable": true, "dtype": "float32", "units": 256, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_6", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_5", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_7", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_8", "trainable": true, "dtype": "float32", "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_9", "trainable": true, "dtype": "float32", "units": 2, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"loss": "categorical_crossentropy", "metrics": ["accuracy"], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0010000000474974513, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of113.bin", "group1-shard2of113.bin", "group1-shard3of113.bin", "group1-shard4of113.bin", "group1-shard5of113.bin", "group1-shard6of113.bin", "group1-shard7of113.bin", "group1-shard8of113.bin", "group1-shard9of113.bin", "group1-shard10of113.bin", "group1-shard11of113.bin", "group1-shard12of113.bin", "group1-shard13of113.bin", "group1-shard14of113.bin", "group1-shard15of113.bin", "group1-shard16of113.bin", "group1-shard17of113.bin", "group1-shard18of113.bin", "group1-shard19of113.bin", "group1-shard20of113.bin", "group1-shard21of113.bin", "group1-shard22of113.bin", "group1-shard23of113.bin", "group1-shard24of113.bin", "group1-shard25of113.bin", "group1-shard26of113.bin", "group1-shard27of113.bin", "group1-shard28of113.bin", "group1-shard29of113.bin", "group1-shard30of113.bin", "group1-shard31of113.bin", "group1-shard32of113.bin", "group1-shard33of113.bin", "group1-shard34of113.bin", "group1-shard35of113.bin", "group1-shard36of113.bin", "group1-shard37of113.bin", "group1-shard38of113.bin", "group1-shard39of113.bin", "group1-shard40of113.bin", "group1-shard41of113.bin", "group1-shard42of113.bin", "group1-shard43of113.bin", "group1-shard44of113.bin", "group1-shard45of113.bin", "group1-shard46of113.bin", "group1-shard47of113.bin", "group1-shard48of113.bin", "group1-shard49of113.bin", "group1-shard50of113.bin", "group1-shard51of113.bin", "group1-shard52of113.bin", "group1-shard53of113.bin", "group1-shard54of113.bin", "group1-shard55of113.bin", "group1-shard56of113.bin", "group1-shard57of113.bin", "group1-shard58of113.bin", "group1-shard59of113.bin", "group1-shard60of113.bin", "group1-shard61of113.bin", "group1-shard62of113.bin", "group1-shard63of113.bin", "group1-shard64of113.bin", "group1-shard65of113.bin", "group1-shard66of113.bin", "group1-shard67of113.bin", "group1-shard68of113.bin", "group1-shard69of113.bin", "group1-shard70of113.bin", "group1-shard71of113.bin", "group1-shard72of113.bin", "group1-shard73of113.bin", "group1-shard74of113.bin", "group1-shard75of113.bin", "group1-shard76of113.bin", "group1-shard77of113.bin", "group1-shard78of113.bin", "group1-shard79of113.bin", "group1-shard80of113.bin", "group1-shard81of113.bin", "group1-shard82of113.bin", "group1-shard83of113.bin", "group1-shard84of113.bin", "group1-shard85of113.bin", "group1-shard86of113.bin", "group1-shard87of113.bin", "group1-shard88of113.bin", "group1-shard89of113.bin", "group1-shard90of113.bin", "group1-shard91of113.bin", "group1-shard92of113.bin", "group1-shard93of113.bin", "group1-shard94of113.bin", "group1-shard95of113.bin", "group1-shard96of113.bin", "group1-shard97of113.bin", "group1-shard98of113.bin", "group1-shard99of113.bin", "group1-shard100of113.bin", "group1-shard101of113.bin", "group1-shard102of113.bin", "group1-shard103of113.bin", "group1-shard104of113.bin", "group1-shard105of113.bin", "group1-shard106of113.bin", "group1-shard107of113.bin", "group1-shard108of113.bin", "group1-shard109of113.bin", "group1-shard110of113.bin", "group1-shard111of113.bin", "group1-shard112of113.bin", "group1-shard113of113.bin"], "weights": [{"name": "conv2d_3/kernel", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "conv2d_3/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_4/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "conv2d_4/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_5/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "conv2d_5/bias", "shape": [128], "dtype": "float32"}, {"name": "dense_5/kernel", "shape": [460800, 256], "dtype": "float32"}, {"name": "dense_5/bias", "shape": [256], "dtype": "float32"}, {"name": "dense_6/kernel", "shape": [256, 128], "dtype": "float32"}, {"name": "dense_6/bias", "shape": [128], "dtype": "float32"}, {"name": "dense_7/kernel", "shape": [128, 64], "dtype": "float32"}, {"name": "dense_7/bias", "shape": [64], "dtype": "float32"}, {"name": "dense_8/kernel", "shape": [64, 32], "dtype": "float32"}, {"name": "dense_8/bias", "shape": [32], "dtype": "float32"}, {"name": "dense_9/kernel", "shape": [32, 2], "dtype": "float32"}, {"name": "dense_9/bias", "shape": [2], "dtype": "float32"}]}]}